#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <time.h>

//**************************************
//関数の読み込み
//*************************************/

//************************************-


#define Tmax 100.0  //シミュレーション時間[sec]
#define dt 0.1 //刻み時間[sec]
double t=0.0;//経過時間[sec]



double X_ref = 0.0;//目標位置ｘ[m]
double Y_ref =0.0;//目標位置ｙ[m]
double Theta =0.0;//進行方向xとyのなす角Θ[rad]
//ロボットパラメータ
double R = 0.1;//タイヤ半径[r]
double L = 0.6;//車軸長[m]
double Wl = 0.0;//左車輪回転数[rad/sec] 路面とタイヤ間の滑りなき場合の速度
double Wr = 0.0;//右車輪回転数[radd/sec]
double X = 0.0;//ロボットの位置ｘ
double Y =0.0;//ロボットの位置ｙ
double Ve = 0.0;//車輪の平均移動速度
/*******************************************************/
//
//メイン関数
//
/*******************************************************/
int main()
{

//ファイル書き込み
  char fname[24];
  FILE *fp;
  sprintf(fname,"move.csv");
  if( (fp = fopen( fname, "w" )) == NULL ) {
    printf( "結果ファイルがオープンできませんでした\n" );
    exit( 1 );
  }

//ヘッダファイルへ出力
  fprintf(fp, "経過時間,x1,y\n");
  while(t<Tmax)
  {
    fprintf(fp,"%f,%f,%f,%f\n",t,X,Y,Theta);

//シミュレーション記載
    //位置の更新
    Wr = -10;
    Wl = 10;
    Ve =R*(Wl+Wr)/2;//平均移動速度
    X +=Ve*cos(Theta*M_PI/180)*dt;
    Y +=Ve*sin(Theta*M_PI/180)*dt;
    Theta += (Wr-Wl)*R/L*dt;




    //データio
    printf("%f %f %f %f\n",t,X,Y,Theta);
    t +=dt; //経過時間更新
  }
  return 0;
}

/************************************************/
//制御
/***********************************************/


/*************************************************/
//モータプラント
/************************************************/

/**********************************************************/
//ルンゲクッタ法
/**********************************************************/
